GopalSaraf/Practicals/PSDL/include/proc/pic16f18115.inc
// Register: ADPCH
#define ADPCH ADPCH
ADPCH                                    equ 01D1Fh
// bitfield definitions
ADPCH_PCH_POSN                           equ 0000h
ADPCH_PCH_POSITION                       equ 0000h
ADPCH_PCH_SIZE                           equ 0008h
ADPCH_PCH_LENGTH                         equ 0008h
ADPCH_PCH_MASK                           equ 00FFh
ADPCH_PCH0_POSN                          equ 0000h
ADPCH_PCH0_POSITION                      equ 0000h
ADPCH_PCH0_SIZE                          equ 0001h
ADPCH_PCH0_LENGTH                        equ 0001h
ADPCH_PCH0_MASK                          equ 0001h
ADPCH_PCH1_POSN                          equ 0001h
ADPCH_PCH1_POSITION                      equ 0001h
ADPCH_PCH1_SIZE                          equ 0001h
ADPCH_PCH1_LENGTH                        equ 0001h
ADPCH_PCH1_MASK                          equ 0002h
ADPCH_PCH2_POSN                          equ 0002h
ADPCH_PCH2_POSITION                      equ 0002h
ADPCH_PCH2_SIZE                          equ 0001h
ADPCH_PCH2_LENGTH                        equ 0001h
ADPCH_PCH2_MASK                          equ 0004h
ADPCH_PCH3_POSN                          equ 0003h
ADPCH_PCH3_POSITION                      equ 0003h
ADPCH_PCH3_SIZE                          equ 0001h
ADPCH_PCH3_LENGTH                        equ 0001h
ADPCH_PCH3_MASK                          equ 0008h
ADPCH_PCH4_POSN                          equ 0004h
ADPCH_PCH4_POSITION                      equ 0004h
ADPCH_PCH4_SIZE                          equ 0001h
ADPCH_PCH4_LENGTH                        equ 0001h
ADPCH_PCH4_MASK                          equ 0010h
ADPCH_PCH5_POSN                          equ 0005h
ADPCH_PCH5_POSITION                      equ 0005h
ADPCH_PCH5_SIZE                          equ 0001h
ADPCH_PCH5_LENGTH                        equ 0001h
ADPCH_PCH5_MASK                          equ 0020h
ADPCH_ADPCH_POSN                         equ 0000h
ADPCH_ADPCH_POSITION                     equ 0000h
ADPCH_ADPCH_SIZE                         equ 0008h
ADPCH_ADPCH_LENGTH                       equ 0008h
ADPCH_ADPCH_MASK                         equ 00FFh

// Register: ADNCH
#define ADNCH ADNCH
ADNCH                                    equ 01D20h
// bitfield definitions
ADNCH_NCH_POSN                           equ 0000h
ADNCH_NCH_POSITION                       equ 0000h
ADNCH_NCH_SIZE                           equ 0008h
ADNCH_NCH_LENGTH                         equ 0008h
ADNCH_NCH_MASK                           equ 00FFh
ADNCH_NCH0_POSN                          equ 0000h
ADNCH_NCH0_POSITION                      equ 0000h
ADNCH_NCH0_SIZE                          equ 0001h
ADNCH_NCH0_LENGTH                        equ 0001h
ADNCH_NCH0_MASK                          equ 0001h
ADNCH_NCH1_POSN                          equ 0001h
ADNCH_NCH1_POSITION                      equ 0001h
ADNCH_NCH1_SIZE                          equ 0001h
ADNCH_NCH1_LENGTH                        equ 0001h
ADNCH_NCH1_MASK                          equ 0002h
ADNCH_NCH2_POSN                          equ 0002h
ADNCH_NCH2_POSITION                      equ 0002h
ADNCH_NCH2_SIZE                          equ 0001h
ADNCH_NCH2_LENGTH                        equ 0001h
ADNCH_NCH2_MASK                          equ 0004h
ADNCH_NCH3_POSN                          equ 0003h
ADNCH_NCH3_POSITION                      equ 0003h
ADNCH_NCH3_SIZE                          equ 0001h
ADNCH_NCH3_LENGTH                        equ 0001h
ADNCH_NCH3_MASK                          equ 0008h
ADNCH_NCH4_POSN                          equ 0004h
ADNCH_NCH4_POSITION                      equ 0004h
ADNCH_NCH4_SIZE                          equ 0001h
ADNCH_NCH4_LENGTH                        equ 0001h
ADNCH_NCH4_MASK                          equ 0010h
ADNCH_NCH5_POSN                          equ 0005h
ADNCH_NCH5_POSITION                      equ 0005h
ADNCH_NCH5_SIZE                          equ 0001h
ADNCH_NCH5_LENGTH                        equ 0001h
ADNCH_NCH5_MASK                          equ 0020h
ADNCH_ADNCH_POSN                         equ 0000h
ADNCH_ADNCH_POSITION                     equ 0000h
ADNCH_ADNCH_SIZE                         equ 0008h
ADNCH_ADNCH_LENGTH                       equ 0008h
ADNCH_ADNCH_MASK                         equ 00FFh

// Register: ADACQL
#define ADACQL ADACQL
ADACQL                                   equ 01D21h
// bitfield definitions
ADACQL_ACQ_POSN                          equ 0000h
ADACQL_ACQ_POSITION                      equ 0000h
ADACQL_ACQ_SIZE                          equ 0008h
ADACQL_ACQ_LENGTH                        equ 0008h
ADACQL_ACQ_MASK                          equ 00FFh
ADACQL_ADACQ0_POSN                       equ 0000h
ADACQL_ADACQ0_POSITION                   equ 0000h
ADACQL_ADACQ0_SIZE                       equ 0001h
ADACQL_ADACQ0_LENGTH                     equ 0001h
ADACQL_ADACQ0_MASK                       equ 0001h
ADACQL_ADACQ1_POSN                       equ 0001h
ADACQL_ADACQ1_POSITION                   equ 0001h
ADACQL_ADACQ1_SIZE                       equ 0001h
ADACQL_ADACQ1_LENGTH                     equ 0001h
ADACQL_ADACQ1_MASK                       equ 0002h
ADACQL_ADACQ2_POSN                       equ 0002h
ADACQL_ADACQ2_POSITION                   equ 0002h
ADACQL_ADACQ2_SIZE                       equ 0001h
ADACQL_ADACQ2_LENGTH                     equ 0001h
ADACQL_ADACQ2_MASK                       equ 0004h
ADACQL_ADACQ3_POSN                       equ 0003h
ADACQL_ADACQ3_POSITION                   equ 0003h
ADACQL_ADACQ3_SIZE                       equ 0001h
ADACQL_ADACQ3_LENGTH                     equ 0001h
ADACQL_ADACQ3_MASK                       equ 0008h
ADACQL_ADACQ4_POSN                       equ 0004h
ADACQL_ADACQ4_POSITION                   equ 0004h
ADACQL_ADACQ4_SIZE                       equ 0001h
ADACQL_ADACQ4_LENGTH                     equ 0001h
ADACQL_ADACQ4_MASK                       equ 0010h
ADACQL_ADACQ5_POSN                       equ 0005h
ADACQL_ADACQ5_POSITION                   equ 0005h
ADACQL_ADACQ5_SIZE                       equ 0001h
ADACQL_ADACQ5_LENGTH                     equ 0001h
ADACQL_ADACQ5_MASK                       equ 0020h
ADACQL_ADACQ6_POSN                       equ 0006h
ADACQL_ADACQ6_POSITION                   equ 0006h
ADACQL_ADACQ6_SIZE                       equ 0001h
ADACQL_ADACQ6_LENGTH                     equ 0001h
ADACQL_ADACQ6_MASK                       equ 0040h
ADACQL_ADACQ7_POSN                       equ 0007h
ADACQL_ADACQ7_POSITION                   equ 0007h
ADACQL_ADACQ7_SIZE                       equ 0001h
ADACQL_ADACQ7_LENGTH                     equ 0001h
ADACQL_ADACQ7_MASK                       equ 0080h
ADACQL_ADACQ_POSN                        equ 0000h
ADACQL_ADACQ_POSITION                    equ 0000h
ADACQL_ADACQ_SIZE                        equ 0008h
ADACQL_ADACQ_LENGTH                      equ 0008h
ADACQL_ADACQ_MASK                        equ 00FFh
ADACQL_ACQ0_POSN                         equ 0000h
ADACQL_ACQ0_POSITION                     equ 0000h
ADACQL_ACQ0_SIZE                         equ 0001h
ADACQL_ACQ0_LENGTH                       equ 0001h
ADACQL_ACQ0_MASK                         equ 0001h
ADACQL_ACQ1_POSN                         equ 0001h
ADACQL_ACQ1_POSITION                     equ 0001h
ADACQL_ACQ1_SIZE                         equ 0001h
ADACQL_ACQ1_LENGTH                       equ 0001h
ADACQL_ACQ1_MASK                         equ 0002h
ADACQL_ACQ2_POSN                         equ 0002h
ADACQL_ACQ2_POSITION                     equ 0002h
ADACQL_ACQ2_SIZE                         equ 0001h
ADACQL_ACQ2_LENGTH                       equ 0001h
ADACQL_ACQ2_MASK                         equ 0004h
ADACQL_ACQ3_POSN                         equ 0003h
ADACQL_ACQ3_POSITION                     equ 0003h
ADACQL_ACQ3_SIZE                         equ 0001h
ADACQL_ACQ3_LENGTH                       equ 0001h
ADACQL_ACQ3_MASK                         equ 0008h
ADACQL_ACQ4_POSN                         equ 0004h
ADACQL_ACQ4_POSITION                     equ 0004h
ADACQL_ACQ4_SIZE                         equ 0001h
ADACQL_ACQ4_LENGTH                       equ 0001h
ADACQL_ACQ4_MASK                         equ 0010h
ADACQL_ACQ5_POSN                         equ 0005h
ADACQL_ACQ5_POSITION                     equ 0005h
ADACQL_ACQ5_SIZE                         equ 0001h
ADACQL_ACQ5_LENGTH                       equ 0001h
ADACQL_ACQ5_MASK                         equ 0020h
ADACQL_ACQ6_POSN                         equ 0006h
ADACQL_ACQ6_POSITION                     equ 0006h
ADACQL_ACQ6_SIZE                         equ 0001h
ADACQL_ACQ6_LENGTH                       equ 0001h
ADACQL_ACQ6_MASK                         equ 0040h
ADACQL_ACQ7_POSN                         equ 0007h
ADACQL_ACQ7_POSITION                     equ 0007h
ADACQL_ACQ7_SIZE                         equ 0001h
ADACQL_ACQ7_LENGTH                       equ 0001h
ADACQL_ACQ7_MASK                         equ 0080h

// Register: ADACQH
#define ADACQH ADACQH
ADACQH                                   equ 01D22h
// bitfield definitions
ADACQH_ACQ_POSN                          equ 0000h
ADACQH_ACQ_POSITION                      equ 0000h
ADACQH_ACQ_SIZE                          equ 0005h
ADACQH_ACQ_LENGTH                        equ 0005h
ADACQH_ACQ_MASK                          equ 001Fh
ADACQH_ADACQ8_POSN                       equ 0000h
ADACQH_ADACQ8_POSITION                   equ 0000h
ADACQH_ADACQ8_SIZE                       equ 0001h
ADACQH_ADACQ8_LENGTH                     equ 0001h
ADACQH_ADACQ8_MASK                       equ 0001h
ADACQH_ADACQ9_POSN                       equ 0001h
ADACQH_ADACQ9_POSITION                   equ 0001h
ADACQH_ADACQ9_SIZE                       equ 0001h
ADACQH_ADACQ9_LENGTH                     equ 0001h
ADACQH_ADACQ9_MASK                       equ 0002h
ADACQH_ADACQ10_POSN                      equ 0002h
ADACQH_ADACQ10_POSITION                  equ 0002h
ADACQH_ADACQ10_SIZE                      equ 0001h
ADACQH_ADACQ10_LENGTH                    equ 0001h
ADACQH_ADACQ10_MASK                      equ 0004h
ADACQH_ADACQ11_POSN                      equ 0003h
ADACQH_ADACQ11_POSITION                  equ 0003h
ADACQH_ADACQ11_SIZE                      equ 0001h
ADACQH_ADACQ11_LENGTH                    equ 0001h
ADACQH_ADACQ11_MASK                      equ 0008h
ADACQH_ADACQ12_POSN                      equ 0004h
ADACQH_ADACQ12_POSITION                  equ 0004h
ADACQH_ADACQ12_SIZE                      equ 0001h
ADACQH_ADACQ12_LENGTH                    equ 0001h
ADACQH_ADACQ12_MASK                      equ 0010h
ADACQH_ADACQ_POSN                        equ 0000h
ADACQH_ADACQ_POSITION                    equ 0000h
ADACQH_ADACQ_SIZE                        equ 0005h
ADACQH_ADACQ_LENGTH                      equ 0005h
ADACQH_ADACQ_MASK                        equ 001Fh
ADACQH_ACQ8_POSN                         equ 0000h
ADACQH_ACQ8_POSITION                     equ 0000h
ADACQH_ACQ8_SIZE                         equ 0001h
ADACQH_ACQ8_LENGTH                       equ 0001h
ADACQH_ACQ8_MASK                         equ 0001h
ADACQH_ACQ9_POSN                         equ 0001h
ADACQH_ACQ9_POSITION                     equ 0001h
ADACQH_ACQ9_SIZE                         equ 0001h
ADACQH_ACQ9_LENGTH                       equ 0001h
ADACQH_ACQ9_MASK                         equ 0002h
ADACQH_ACQ10_POSN                        equ 0002h
ADACQH_ACQ10_POSITION                    equ 0002h
ADACQH_ACQ10_SIZE                        equ 0001h
ADACQH_ACQ10_LENGTH                      equ 0001h
ADACQH_ACQ10_MASK                        equ 0004h
ADACQH_ACQ11_POSN                        equ 0003h
ADACQH_ACQ11_POSITION                    equ 0003h
ADACQH_ACQ11_SIZE                        equ 0001h
ADACQH_ACQ11_LENGTH                      equ 0001h
ADACQH_ACQ11_MASK                        equ 0008h
ADACQH_ACQ12_POSN                        equ 0004h
ADACQH_ACQ12_POSITION                    equ 0004h
ADACQH_ACQ12_SIZE                        equ 0001h
ADACQH_ACQ12_LENGTH                      equ 0001h
ADACQH_ACQ12_MASK                        equ 0010h

// Register: ADCAP
#define ADCAP ADCAP
ADCAP                                    equ 01D23h
// bitfield definitions
ADCAP_ADCAP_POSN                         equ 0000h
ADCAP_ADCAP_POSITION                     equ 0000h
ADCAP_ADCAP_SIZE                         equ 0005h
ADCAP_ADCAP_LENGTH                       equ 0005h
ADCAP_ADCAP_MASK                         equ 001Fh
ADCAP_ADCAP0_POSN                        equ 0000h
ADCAP_ADCAP0_POSITION                    equ 0000h
ADCAP_ADCAP0_SIZE                        equ 0001h
ADCAP_ADCAP0_LENGTH                      equ 0001h
ADCAP_ADCAP0_MASK                        equ 0001h
ADCAP_ADCAP1_POSN                        equ 0001h
ADCAP_ADCAP1_POSITION                    equ 0001h
ADCAP_ADCAP1_SIZE                        equ 0001h
ADCAP_ADCAP1_LENGTH                      equ 0001h
ADCAP_ADCAP1_MASK                        equ 0002h
ADCAP_ADCAP2_POSN                        equ 0002h
ADCAP_ADCAP2_POSITION                    equ 0002h
ADCAP_ADCAP2_SIZE                        equ 0001h
ADCAP_ADCAP2_LENGTH                      equ 0001h
ADCAP_ADCAP2_MASK                        equ 0004h
ADCAP_ADCAP3_POSN                        equ 0003h
ADCAP_ADCAP3_POSITION                    equ 0003h
ADCAP_ADCAP3_SIZE                        equ 0001h
ADCAP_ADCAP3_LENGTH                      equ 0001h
ADCAP_ADCAP3_MASK                        equ 0008h
ADCAP_ADCAP4_POSN                        equ 0004h
ADCAP_ADCAP4_POSITION                    equ 0004h
ADCAP_ADCAP4_SIZE                        equ 0001h
ADCAP_ADCAP4_LENGTH                      equ 0001h
ADCAP_ADCAP4_MASK                        equ 0010h

// Register: ADPREL
#define ADPREL ADPREL
ADPREL                                   equ 01D24h
// bitfield definitions
ADPREL_PRE_POSN                          equ 0000h
ADPREL_PRE_POSITION                      equ 0000h
ADPREL_PRE_SIZE                          equ 0008h
ADPREL_PRE_LENGTH                        equ 0008h
ADPREL_PRE_MASK                          equ 00FFh
ADPREL_PRE0_POSN                         equ 0000h
ADPREL_PRE0_POSITION                     equ 0000h
ADPREL_PRE0_SIZE                         equ 0001h
ADPREL_PRE0_LENGTH                       equ 0001h
ADPREL_PRE0_MASK                         equ 0001h
ADPREL_PRE1_POSN                         equ 0001h
ADPREL_PRE1_POSITION                     equ 0001h
ADPREL_PRE1_SIZE                         equ 0001h
ADPREL_PRE1_LENGTH                       equ 0001h
ADPREL_PRE1_MASK                         equ 0002h
ADPREL_PRE2_POSN                         equ 0002h
ADPREL_PRE2_POSITION                     equ 0002h
ADPREL_PRE2_SIZE                         equ 0001h
ADPREL_PRE2_LENGTH                       equ 0001h
ADPREL_PRE2_MASK                         equ 0004h
ADPREL_PRE3_POSN                         equ 0003h
ADPREL_PRE3_POSITION                     equ 0003h
ADPREL_PRE3_SIZE                         equ 0001h
ADPREL_PRE3_LENGTH                       equ 0001h
ADPREL_PRE3_MASK                         equ 0008h
ADPREL_PRE4_POSN                         equ 0004h
ADPREL_PRE4_POSITION                     equ 0004h
ADPREL_PRE4_SIZE                         equ 0001h
ADPREL_PRE4_LENGTH                       equ 0001h
ADPREL_PRE4_MASK                         equ 0010h
ADPREL_PRE5_POSN                         equ 0005h
ADPREL_PRE5_POSITION                     equ 0005h
ADPREL_PRE5_SIZE                         equ 0001h
ADPREL_PRE5_LENGTH                       equ 0001h
ADPREL_PRE5_MASK                         equ 0020h
ADPREL_PRE6_POSN                         equ 0006h
ADPREL_PRE6_POSITION                     equ 0006h
ADPREL_PRE6_SIZE                         equ 0001h
ADPREL_PRE6_LENGTH                       equ 0001h
ADPREL_PRE6_MASK                         equ 0040h
ADPREL_PRE7_POSN                         equ 0007h
ADPREL_PRE7_POSITION                     equ 0007h
ADPREL_PRE7_SIZE                         equ 0001h
ADPREL_PRE7_LENGTH                       equ 0001h
ADPREL_PRE7_MASK                         equ 0080h
ADPREL_ADPRE_POSN                        equ 0000h
ADPREL_ADPRE_POSITION                    equ 0000h
ADPREL_ADPRE_SIZE                        equ 0008h
ADPREL_ADPRE_LENGTH                      equ 0008h
ADPREL_ADPRE_MASK                        equ 00FFh
ADPREL_ADPRE0_POSN                       equ 0000h
ADPREL_ADPRE0_POSITION                   equ 0000h
ADPREL_ADPRE0_SIZE                       equ 0001h
ADPREL_ADPRE0_LENGTH                     equ 0001h
ADPREL_ADPRE0_MASK                       equ 0001h
ADPREL_ADPRE1_POSN                       equ 0001h
ADPREL_ADPRE1_POSITION                   equ 0001h
ADPREL_ADPRE1_SIZE                       equ 0001h
ADPREL_ADPRE1_LENGTH                     equ 0001h
ADPREL_ADPRE1_MASK                       equ 0002h
ADPREL_ADPRE2_POSN                       equ 0002h
ADPREL_ADPRE2_POSITION                   equ 0002h
ADPREL_ADPRE2_SIZE                       equ 0001h
ADPREL_ADPRE2_LENGTH                     equ 0001h
ADPREL_ADPRE2_MASK                       equ 0004h
ADPREL_ADPRE3_POSN                       equ 0003h
ADPREL_ADPRE3_POSITION                   equ 0003h
ADPREL_ADPRE3_SIZE                       equ 0001h
ADPREL_ADPRE3_LENGTH                     equ 0001h
ADPREL_ADPRE3_MASK                       equ 0008h
ADPREL_ADPRE4_POSN                       equ 0004h
ADPREL_ADPRE4_POSITION                   equ 0004h
ADPREL_ADPRE4_SIZE                       equ 0001h
ADPREL_ADPRE4_LENGTH                     equ 0001h
ADPREL_ADPRE4_MASK                       equ 0010h
ADPREL_ADPRE5_POSN                       equ 0005h
ADPREL_ADPRE5_POSITION                   equ 0005h
ADPREL_ADPRE5_SIZE                       equ 0001h
ADPREL_ADPRE5_LENGTH                     equ 0001h
ADPREL_ADPRE5_MASK                       equ 0020h
ADPREL_ADPRE6_POSN                       equ 0006h
ADPREL_ADPRE6_POSITION                   equ 0006h
ADPREL_ADPRE6_SIZE                       equ 0001h
ADPREL_ADPRE6_LENGTH                     equ 0001h
ADPREL_ADPRE6_MASK                       equ 0040h
ADPREL_ADPRE7_POSN                       equ 0007h
ADPREL_ADPRE7_POSITION                   equ 0007h
ADPREL_ADPRE7_SIZE                       equ 0001h
ADPREL_ADPRE7_LENGTH                     equ 0001h
ADPREL_ADPRE7_MASK                       equ 0080h

// Register: ADPREH
#define ADPREH ADPREH
ADPREH                                   equ 01D25h
// bitfield definitions
ADPREH_PRE_POSN                          equ 0000h
ADPREH_PRE_POSITION                      equ 0000h
ADPREH_PRE_SIZE                          equ 0005h
ADPREH_PRE_LENGTH                        equ 0005h
ADPREH_PRE_MASK                          equ 001Fh
ADPREH_PRE8_POSN                         equ 0000h
ADPREH_PRE8_POSITION                     equ 0000h
ADPREH_PRE8_SIZE                         equ 0001h
ADPREH_PRE8_LENGTH                       equ 0001h
ADPREH_PRE8_MASK                         equ 0001h
ADPREH_PRE9_POSN                         equ 0001h
ADPREH_PRE9_POSITION                     equ 0001h
ADPREH_PRE9_SIZE                         equ 0001h
ADPREH_PRE9_LENGTH                       equ 0001h
ADPREH_PRE9_MASK                         equ 0002h
ADPREH_PRE10_POSN                        equ 0002h
ADPREH_PRE10_POSITION                    equ 0002h
ADPREH_PRE10_SIZE                        equ 0001h
ADPREH_PRE10_LENGTH                      equ 0001h
ADPREH_PRE10_MASK                        equ 0004h
ADPREH_PRE11_POSN                        equ 0003h
ADPREH_PRE11_POSITION                    equ 0003h
ADPREH_PRE11_SIZE                        equ 0001h
ADPREH_PRE11_LENGTH                      equ 0001h
ADPREH_PRE11_MASK                        equ 0008h
ADPREH_PRE12_POSN                        equ 0004h
ADPREH_PRE12_POSITION                    equ 0004h
ADPREH_PRE12_SIZE                        equ 0001h
ADPREH_PRE12_LENGTH                      equ 0001h
ADPREH_PRE12_MASK                        equ 0010h
ADPREH_ADPRE_POSN                        equ 0000h
ADPREH_ADPRE_POSITION                    equ 0000h
ADPREH_ADPRE_SIZE                        equ 0005h
ADPREH_ADPRE_LENGTH                      equ 0005h
ADPREH_ADPRE_MASK                        equ 001Fh
ADPREH_ADPRE8_POSN                       equ 0000h
ADPREH_ADPRE8_POSITION                   equ 0000h
ADPREH_ADPRE8_SIZE                       equ 0001h
ADPREH_ADPRE8_LENGTH                     equ 0001h
ADPREH_ADPRE8_MASK                       equ 0001h
ADPREH_ADPRE9_POSN                       equ 0001h
ADPREH_ADPRE9_POSITION                   equ 0001h
ADPREH_ADPRE9_SIZE                       equ 0001h
ADPREH_ADPRE9_LENGTH                     equ 0001h
ADPREH_ADPRE9_MASK                       equ 0002h
ADPREH_ADPRE10_POSN                      equ 0002h
ADPREH_ADPRE10_POSITION                  equ 0002h
ADPREH_ADPRE10_SIZE                      equ 0001h
ADPREH_ADPRE10_LENGTH                    equ 0001h
ADPREH_ADPRE10_MASK                      equ 0004h
ADPREH_ADPRE11_POSN                      equ 0003h
ADPREH_ADPRE11_POSITION                  equ 0003h
ADPREH_ADPRE11_SIZE                      equ 0001h
ADPREH_ADPRE11_LENGTH                    equ 0001h
ADPREH_ADPRE11_MASK                      equ 0008h
ADPREH_ADPRE12_POSN                      equ 0004h
ADPREH_ADPRE12_POSITION                  equ 0004h
ADPREH_ADPRE12_SIZE                      equ 0001h
ADPREH_ADPRE12_LENGTH                    equ 0001h
ADPREH_ADPRE12_MASK                      equ 0010h

